public class OOP {
//    Task_1
//    Опишите класс Animal. У класса Animal должны быть свойства:
//
//    type - тип животного (String)
//    name - имя животного (String)
//    age - возраст животного (int)
//    weight - вес животного (double)
//    isFly - ответ на вопрос, умеет ли это животное летать? (boolean)
//    isWalk - ответ на вопрос, умеет ли это животное ходить? (boolean)
//    isSwim -  ответ на вопрос, умеет ли это животное плавать? (boolean)
//    У животного должны быть методы:
//
//    display  - выводит информацию о животном в формате: "Тип: <Тип животного>, Имя: <Имя животного>, Возраст: <Возраст животного>, Вес: <Вес животного>, Умеет летать: <Да/Нет>, Умеет ходить: <Да/Нет>, Умеет плавать: <Да/Нет>."
//    rename(String) - принимает новое имя животного
//    holiday(int) - принимает на вход число праздничных дней. Увеличивает массу животного на 0.1 за каждый праздничный день.
}
